### Panda functions

In [2]:
import pandas as pd

In [4]:
ser=pd.Series(['100','300','5000',900,800],[200,450,'Ramu','Haresh','Nitesh'])

In [6]:
ser

200        100
450        300
Ramu      5000
Haresh     900
Nitesh     800
dtype: object

In [26]:
ser=pd.Series(['a','b','c','d','e'],[1,2,6,4,5])

In [28]:
print(ser)

1    a
2    b
6    c
4    d
5    e
dtype: object

In [30]:
ser.index

Index([1, 2, 6, 4, 5], dtype='int64')

In [15]:
ser[[1,4,5]]

NameError: name 'ser' is not defined

In [39]:
ser.iloc[3]

'd'

In [43]:
ser.loc[[4,5,6]]

4    d
5    e
6    c
dtype: object

## Dataframe

In [58]:
a={'one':pd.Series([10,20,30,40,50],index=['a','b','c','d','e']),
   'two':pd.Series([-10,-20,-30,40,-50],index=['a','b','c','d','e'])
  }

In [1]:
df=pd.DataFrame(a)

NameError: name 'pd' is not defined

In [64]:
print(df)

   one  two
a   10  -10
b   20  -20
c   30  -30
d   40   40
e   50  -50

In [66]:
df

   one  two
a   10  -10
b   20  -20
c   30  -30
d   40   40
e   50  -50

In [68]:
df.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [70]:
df.loc['b']

one    20
two   -20
Name: b, dtype: int64

In [110]:
df.loc['c']

one    30
two   -30
Name: c, dtype: int64

In [74]:
df.iloc[0

one    10
two   -10
Name: a, dtype: int64

In [116]:
b={'english':pd.Series([10,20,30,40,50],index=['avi','bishal','chan','drona','elle']),
   'math':pd.Series([10,20,30,40,50],index=['avi','bishal','chan','drona','elle']),
   'science':pd.Series([10,20,30,40,50],index=['avi','bishal','chan','drona','elle'])
  }

In [86]:
ad=pd.DataFrame(b)

In [118]:
ad

   english  math  science
a       10   -10      -10
b       20   -20      -20
c       30   -30      -30
d       40    40       40
e       50   -50      -50

In [94]:
ad.loc[['a']]

   english  math  science
a       10   -10      -10

In [114]:
ad.iloc[2]

english    30
math      -30
science   -30
Name: c, dtype: int64

In [180]:
b={'english':([10,20,30,40,50]),
   'math':([10,20,30,40,50]),
   'science':([10,20,30,40,50])
  }

In [182]:
ad=pd.DataFrame(b,index=['a','b','c','d','e'],columns=['english','math','science'])

In [184]:
ad

   english  math  science
a       10    10       10
b       20    20       20
c       30    30       30
d       40    40       40
e       50    50       50

In [143]:
data=[{'ram':100,'shyam':200} ,{'ema':50,'ramu':80}]

In [188]:
df1=pd.DataFrame(data)

In [186]:
df1

                 ram  shyam   ema  ramu
First Number   100.0  200.0   NaN   NaN
Second Number    NaN    NaN  50.0  80.0

In [149]:
df1=pd.DataFrame(data,index=['First Number','Second Number'])

In [151]:
df1

                 ram  shyam   ema  ramu
First Number   100.0  200.0   NaN   NaN
Second Number    NaN    NaN  50.0  80.0

In [153]:
df2=pd.DataFrame(data,columns=['ram','ema'])

In [155]:
df2

     ram   ema
0  100.0   NaN
1    NaN  50.0

In [161]:
c={'english':([90,23,35,40,50,80,90,99,89]),
   'math':([60,80,30,20,95,70,77,89,90]),
   'science':([50,60,70,40,10,20,30,40,50])
  }
marks=pd.DataFrame(c,index=['a','b','c','d','e','f','g','h','i'])

In [165]:
marks

   english  math  science
a       90    60       50
b       23    80       60
c       35    30       70
d       40    20       40
e       50    95       10
f       80    70       20
g       90    77       30
h       99    89       40
i       89    90       50

### Head & Tail

In [168]:
type(marks)

pandas.core.frame.DataFrame

In [170]:
marks.head()

   english  math  science
a       90    60       50
b       23    80       60
c       35    30       70
d       40    20       40
e       50    95       10

In [172]:
marks.tail()

   english  math  science
e       50    95       10
f       80    70       20
g       90    77       30
h       99    89       40
i       89    90       50

In [178]:
marks.head(8)

   english  math  science
a       90    60       50
b       23    80       60
c       35    30       70
d       40    20       40
e       50    95       10
f       80    70       20
g       90    77       30
h       99    89       40

In [176]:
marks.tail(4)

   english  math  science
f       80    70       20
g       90    77       30
h       99    89       40
i       89    90       50